In [52]:
import pandas as pd
data = pd.read_csv("cats.csv")
list(data.columns)

['Unnamed: 0', 'Breed', 'Age (Years)', 'Weight (kg)', 'Color', 'Gender', 'ID']

In [53]:
data.columns

Index(['Unnamed: 0', 'Breed', 'Age (Years)', 'Weight (kg)', 'Color', 'Gender',
       'ID'],
      dtype='object')

In [54]:
data.drop(['Unnamed: 0'], inplace=True, axis=1)

In [64]:
data.columns

Index(['Breed', 'Age (Years)', 'Weight (kg)', 'Color', 'Gender', 'ID',
       'Weight (lbs)'],
      dtype='object')

In [55]:
data.head

<bound method NDFrame.head of              Breed  Age (Years)  Weight (kg)          Color  Gender   ID
0     Egyptian Mau           12            7          White    Male  181
1    Scottish Fold           17            8  Tortoiseshell    Male  907
2           Sphynx            9            9         Orange    Male  732
3         Oriental            6            7           Gray  Female  464
4         Savannah           14            7  Tortoiseshell  Female  451
..             ...          ...          ...            ...     ...  ...
995     Abyssinian           18            3          Black  Female  347
996        Burmese            4            5        Pointed  Female  339
997        Persian           19            9          Cream    Male  659
998        Persian           17            3        Bicolor  Female  124
999           Manx           18            8          Black    Male  226

[1000 rows x 6 columns]>

In [56]:
result = data.iloc[98]

print(result)

Breed          Maine Coon
Age (Years)             9
Weight (kg)             5
Color                Blue
Gender             Female
ID                    590
Name: 98, dtype: object

In [57]:
data.loc[98]["Breed"]

'Maine Coon'

In [58]:
data.loc[len(data)] = ["Orange Tabby", 3, 5, "Orange", "Male", len(data)]

In [59]:
data

              Breed  Age (Years)  Weight (kg)          Color  Gender    ID
0      Egyptian Mau           12            7          White    Male   181
1     Scottish Fold           17            8  Tortoiseshell    Male   907
2            Sphynx            9            9         Orange    Male   732
3          Oriental            6            7           Gray  Female   464
4          Savannah           14            7  Tortoiseshell  Female   451
...             ...          ...          ...            ...     ...   ...
996         Burmese            4            5        Pointed  Female   339
997         Persian           19            9          Cream    Male   659
998         Persian           17            3        Bicolor  Female   124
999            Manx           18            8          Black    Male   226
1000   Orange Tabby            3            5         Orange    Male  1000

[1001 rows x 6 columns]

In [61]:
#new_row = {'Breed': 'Orange Tabby', 'Age (Years)': 3, 'Weight (kg)': 5}

#data = data.append(new_row, ignore_index=True)

#print(data)

In [62]:
data['Weight (lbs)'] = data['Weight (kg)'] * 2.205

In [63]:
data

,Breed,Age (Years),Weight (kg),Color,Gender,ID,Weight (lbs)
0,Egyptian Mau,12,7,White,Male,181.0,15.435
1,Scottish Fold,17,8,Tortoiseshell,Male,907.0,17.640
2,Sphynx,9,9,Orange,Male,732.0,19.845
3,Oriental,6,7,Gray,Female,464.0,15.435
4,Savannah,14,7,Tortoiseshell,Female,451.0,15.435
...,...,...,...,...,...,...,...
997,Persian,19,9,Cream,Male,659.0,19.845
998,Persian,17,3,Bicolor,Female,124.0,6.615
999,Manx,18,8,Black,Male,226.0,17.640
1000,Orange Tabby,3,5,Orange,Male,1000.0,11.025
1001,Orange Tabby,3,5,NaN,NaN,NaN,11.025